app/controllers/movies_controller.rb

  def index
    @sort = params[:sort] ? params[:sort] : session[:prev_sort]
    session[:prev_sort] = @sort

    @all_ratings = Movie.all_ratings.keys
    @filter_ratings = params[:ratings] ? params[:ratings] : prev_ratings_nil
    session[:prev_ratings] = @filter_ratings

    if !@sort.nil?
	@movies = Movie.find(:all, :conditions => {"rating" => @filter_ratings.keys}, :order => "#{@sort} ASC")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') AND "movies"."id" = ? LIMIT 1  [["id", :rating]]